app/controllers/navigations_controller.rb

  def index
    @tab_color = true #background color for the table
    if new_comer?
      redirect_to edit_profile_path(current_user)
    else
      if administrator_logged_in?
        redirect_to users_path
      else
        @navigations = current_user.navigations.all
---
SELECT "navigations".* FROM "navigations" WHERE ("navigations".user_id = 2) ORDER BY created_at DESC, date_embarquement DESC

  def index_admin
    if administrator_logged_in?
      @tab_color = true #background color for the table
      @owner = User.find(params[:id])
      @navigations = @owner.navigations
      if @navigations.size.eql?(0) #to avoid bug when savage user hits 0
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "navigations".* FROM "navigations" WHERE ("navigations".user_id = 6) ORDER BY created_at DESC, date_embarquement DESC
SELECT COUNT(*) FROM "navigations" WHERE ("navigations".user_id = 6)

  def show
    @navigations = Navigation.find_by_id(params[:id])
---
SELECT "navigations".* FROM "navigations" WHERE "navigations"."id" = 18 LIMIT 1

  def new
    if new_comer?
      redirect_to edit_profile_path(current_user), :alert => 'Veuillez completer votre profil pour continuer.'
    else
      @navigation = Navigation.new
      @selected_crew = nil
      @crew = Crewmanagement.all
---
SELECT "crewmanagements".* FROM "crewmanagements"

  def edit
    @navigation = current_user.navigations.find(params[:id])
    @crew = Crewmanagement.all
---
SELECT "navigations".* FROM "navigations" WHERE "navigations"."id" = 21 AND ("navigations".user_id = 1) ORDER BY created_at DESC, date_embarquement DESC LIMIT 1
SELECT "crewmanagements".* FROM "crewmanagements"

  def create
    @navigation = current_user.navigations.new(params[:navigation])
    #@poste = params[:fonction_occupee][:crew_id]
    @nom_poste = Crewmanagement.find_by_id(params[:fonction_occupee][:crew_id])
    respond_to do |format|
      if @navigation.save
        @navigation.update_attributes(:fonction_occupee => @nom_poste.fonction)
---
SELECT "crewmanagements".* FROM "crewmanagements" WHERE "crewmanagements"."id" = 1 LIMIT 1
INSERT INTO "navigations" ("user_id", "date_embarquement", "type_navire", "navire", "updated_at", "fonction_occupee", "compagnie", "date_debarquement", "created_at", "pavillon") VALUES (5, '2011-06-17 17:08:00.000000', 'Bombardier', 'Mendez', '2011-06-17 17:08:38.306819', 'Capitaine', 'Bittorez', '2011-06-17 17:08:00.000000', '2011-06-17 17:08:38.306819', '7') RETURNING "id"
UPDATE "navigations" SET "fonction_occupee" = 'Commandant', "updated_at" = '2011-07-07 11:27:04.987332' WHERE "navigations"."id" = 35

  def update
    @fonction = Crewmanagement.find_by_id(params[:fonction_occupee][:crew_id])
    @navigation = current_user.navigations.find(params[:id])
    respond_to do |format|
      if @navigation.update_attributes(params[:navigation])
---
SELECT "crewmanagements".* FROM "crewmanagements" WHERE "crewmanagements"."id" = 4 LIMIT 1
SELECT "navigations".* FROM "navigations" WHERE "navigations"."id" = 26 AND ("navigations".user_id = 6) ORDER BY created_at DESC, date_embarquement DESC LIMIT 1
UPDATE "navigations" SET "fonction_occupee" = 'Elève officier pont', "updated_at" = '2011-06-22 16:25:20.082919' WHERE "navigations"."id" = 26