app/controllers/profiles_controller.rb

  def edit
    @profile = current_user.profile
    @crew = Crewmanagement.all
---
SELECT "crewmanagements".* FROM "crewmanagements"

  def update
    @fonction = Crewmanagement.find_by_id(params[:fonction_occupee][:crew_id])
    @profile = current_user.profile
    respond_to do |format|
      if @profile.update_attributes(params[:profile])
---
SELECT "crewmanagements".* FROM "crewmanagements" WHERE "crewmanagements"."id" = 8 LIMIT 1
UPDATE "profiles" SET "adresse_postale" = '', "date_lieu_naissance" = '', "validite_livret" = '2011-06-20 07:24:00.000000', "date_lieu_naissance_pere" = '', "nom_prenom_mere" = '', "nom_prenom_pere" = '', "validite_passeport" = '2011-06-20 07:24:00.000000', "nationalite_pere" = '', "prenom" = '', "brevet" = '', "adresse_postale_correspondant" = '', "updated_at" = '2011-06-20 07:25:44.743484', "nom" = 'Duke', "niveau_scolaire" = '', "date_lieu_naissance_epouse" = '', "numero_livret_maritime" = '', "nationalite_mere" = '', "date_lieu_naissance_mere" = '', "numero_cnps" = '', "validite_visite" = '2011-06-20 07:24:00.000000', "lieu_residence" = '', "situation_matrimoniale" = '', "nationalite" = '', "fonction" = '', "numero_telephone_correspondant" = '', "visite_medicale" = '', "lien_avec_travailleur" = '', "numero_cni" = '', "nationalite_epouse" = '', "numero_passeport" = '', "numero_telephone" = '', "nom_prenom_epouse" = '', "nom_prenom_correspondant" = '' WHERE "profiles"."id" = 10