app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."statut" = 'Utilisateur' ORDER BY nom asc
---
  def index
    #@users = User.all
    @users = User.find_all_by_statut('Utilisateur')

INSERT INTO "users" ("hashed_password", "updated_at", "created_at", "email", "statut") VALUES ('654ef0789cb92b35fdb6f214a9fc718eb01c0eb8', '2011-06-19 10:27:05.301426', '2011-06-19 10:27:05.301426', 'lucolivieraaa@yahoo.fr', NULL) RETURNING "id"
INSERT INTO "profiles" ("numero_cnps", "date_lieu_naissance_mere", "brevet", "user_id", "nationalite_mere", "nom", "updated_at", "adresse_postale", "numero_passeport", "visite_medicale", "nationalite", "nationalite_epouse", "numero_livret_maritime", "situation_matrimoniale", "numero_cni", "numero_telephone", "lien_avec_travailleur", "validite_visite", "prenom", "validite_passeport", "nom_prenom_pere", "nom_prenom_correspondant", "created_at", "date_lieu_naissance", "adresse_postale_correspondant", "validite_livret", "lieu_residence", "niveau_scolaire", "nationalite_pere", "nom_prenom_mere", "fonction", "nombre_enfants", "nom_prenom_epouse", "date_lieu_naissance_epouse", "numero_telephone_correspondant", "date_lieu_naissance_pere") VALUES (NULL, NULL, NULL, 23, NULL, 'newcomer', '2011-06-26 11:28:47.970087', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2011-06-26 11:28:47.970087', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save
      @user.update_attribute :statut, 'Utilisateur'
      @user.create_profile(:nom => 'newcomer') #,:prenom => 'newcomer', :fonction => 'newcomer', :brevet => 'newcomer', :niveau_scolaire => 'newcomer', :situation_matrimoniale => 'newcomer', :numero_passeport => 'newcomer', :numero_livret_maritime => 'newcomer', :visite_medicale => 'newcomer', :numero_cnps => 'newcomer', :numero_cni => 'newcomer', :numero_telephone => 'newcomer', :nom_prenom_correspondant => 'newcomer', :lien_avec_travailleur => 'newcomer', :numero_telephone_correspondant => 'newcomer'

UPDATE "users" SET "updated_at" = '2011-06-20 07:20:22.978861', "hashed_password" = '45b0825ba45e2ca53bf46bd2d40ac292d767f081' WHERE "users"."id" = 17
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."fonction" = 'Second mécanicien'
---
  def personnel
    @fonction = params[:id]
    @profiles = Profile.find_all_by_fonction(@fonction)